Tekla.Structures.Filtering.BooleanFilterExpression
The BooleanFilterExpression class represents a Boolean filter expression.

Tekla.Structures.Filtering.BooleanFilterExpression.#ctor(System.String)
Initializes a new instance of the BooleanFilterExpression class.
Value: The value to represent.

Tekla.Structures.Filtering.BooleanFilterExpression.#ctor(System.String,System.String,System.String,System.String)
Initializes a new instance of the BooleanFilterExpression class.
Name: The name of the expression.
Category: The category of the expression.
Property: The property of the expression.
LocalizationKey: The localization key of the expression.